app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def index
    @recipe = Recipe.all

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def destroy
    @recipe = Recipe.find(params[:id])